seanmlyons22/ti-lprf-pacs/svds/cc2640r2.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>AON_RTC</name>
      <baseAddress>0x40092000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <description>This component control the Real Time Clock residing in AON

Note: This module is only supporting 32 bit ReadWrite access.</description>
      <registers>
        <register>
          <name>CTL</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Control

This register contains various  bitfields for configuration of RTC</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED19</name>
              <description>[31:19] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>13</bitWidth>
              <bitOffset>19</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>COMB_EV_MASK</name>
              <description>[18:16] Eventmask selecting which delayed events that form the combined event.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH2</name>
                  <value>4</value>
                  <description>Use Channel 2 delayed event in combined event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1</name>
                  <value>2</value>
                  <description>Use Channel 1 delayed event in combined event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH0</name>
                  <value>1</value>
                  <description>Use Channel 0 delayed event in combined event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>No event is selected for combined event.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED12</name>
              <description>[15:12] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EV_DELAY</name>
              <description>[11:8] Number of SCLK_LF clock cycles waited before generating delayed events. (Common setting for all RTC cannels)  the delayed event is delayed</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>D144</name>
                  <value>13</value>
                  <description>Delay by 144 clock cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D128</name>
                  <value>12</value>
                  <description>Delay by 128 clock cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D112</name>
                  <value>11</value>
                  <description>Delay by 112 clock cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D96</name>
                  <value>10</value>
                  <description>Delay by 96 clock cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D80</name>
                  <value>9</value>
                  <description>Delay by 80 clock cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D64</name>
                  <value>8</value>
                  <description>Delay by 64 clock cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D48</name>
                  <value>7</value>
                  <description>Delay by 48 clock cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D32</name>
                  <value>6</value>
                  <description>Delay by 32 clock cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D16</name>
                  <value>5</value>
                  <description>Delay by 16 clock cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D8</name>
                  <value>4</value>
                  <description>Delay by 8 clock cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D4</name>
                  <value>3</value>
                  <description>Delay by 4 clock cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D2</name>
                  <value>2</value>
                  <description>Delay by 2 clock cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D1</name>
                  <value>1</value>
                  <description>Delay by 1 clock cycles</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D0</name>
                  <value>0</value>
                  <description>No delay on delayed event</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESET</name>
              <description>[7:7] RTC Counter reset.

Writing 1 to this bit will reset the RTC counter.

This bit is cleared when reset takes effect</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>RESERVED3</name>
              <description>[6:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RTC_4KHZ_EN</name>
              <description>[2:2] RTC_4KHZ is a 4 KHz reference output, tapped from  SUBSEC.VALUE  bit 19 which is used by AUX timer.

0: RTC_4KHZ signal is forced to 0
1: RTC_4KHZ is enabled ( provied that RTC is enabled EN)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RTC_UPD_EN</name>
              <description>[1:1] RTC_UPD is a 16 KHz signal used to sync up the radio timer. The 16 Khz is SCLK_LF divided by 2

0: RTC_UPD signal is forced to 0
1: RTC_UPD signal is toggling @16 kHz</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>[0:0] Enable RTC counter

0: Halted (frozen)
1: Running</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>EVFLAGS</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Event Flags, RTC Status

This register contains event flags from the 3 RTC channels. Each flag will be cleared when writing a '1' to the corresponding bitfield.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED17</name>
              <description>[31:17] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>15</bitWidth>
              <bitOffset>17</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CH2</name>
              <description>[16:16] Channel 2 event flag, set when CHCTL.CH2_EN = 1 and the RTC value matches or passes the CH2CMP value.

An event will be scheduled to occur as soon as possible when writing to CH2CMP provided that the channel is enabled and the new value matches any time between next  RTC value and 1 second in the past

