seanmlyons22/ti-lprf-pacs/svds/cc2640r2.svd
To manually trigger vector 2 execution:
- AUX_SCE must sleep.
- Set VEC2_EV to a known static value.
- Toggle VEC2_POL twice.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FALL</name>
                  <value>1</value>
                  <description>Falling edge triggers vector 2 execution.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <value>0</value>
                  <description>Rising edge triggers vector 2 execution.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VEC2_EN</name>
              <description>[5:5] Vector 2 trigger enable.

When enabled, VEC2_EV event with VEC2_POL polarity triggers a jump to vector # 2 when AUX_SCE sleeps.

Lower vectors (0 and 1) have priority.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Enable vector 2 trigger.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Disable vector 2 trigger.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VEC2_EV</name>
              <description>[4:0] Select vector 2 trigger source event.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_IRQ</name>
                  <value>31</value>
                  <description>EVSTAT1.ADC_IRQ</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCU_EV</name>
                  <value>30</value>
                  <description>EVSTAT1.MCU_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACLK_REF</name>
                  <value>29</value>
                  <description>EVSTAT1.ACLK_REF</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO15</name>
                  <value>28</value>
                  <description>EVSTAT1.AUXIO15</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO14</name>
                  <value>27</value>
                  <description>EVSTAT1.AUXIO14</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO13</name>
                  <value>26</value>
                  <description>EVSTAT1.AUXIO13</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO12</name>
                  <value>25</value>
                  <description>EVSTAT1.AUXIO12</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO11</name>
                  <value>24</value>
                  <description>EVSTAT1.AUXIO11</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO10</name>
                  <value>23</value>
                  <description>EVSTAT1.AUXIO10</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO9</name>
                  <value>22</value>
                  <description>EVSTAT1.AUXIO9</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO8</name>
                  <value>21</value>
                  <description>EVSTAT1.AUXIO8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO7</name>
                  <value>20</value>
                  <description>EVSTAT1.AUXIO7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO6</name>
                  <value>19</value>
                  <description>EVSTAT1.AUXIO6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO5</name>
                  <value>18</value>
                  <description>EVSTAT1.AUXIO5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO4</name>
                  <value>17</value>
                  <description>EVSTAT1.AUXIO4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO3</name>
                  <value>16</value>
                  <description>EVSTAT1.AUXIO3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO2</name>
                  <value>15</value>
                  <description>EVSTAT0.AUXIO2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO1</name>
                  <value>14</value>
                  <description>EVSTAT0.AUXIO1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO0</name>
                  <value>13</value>
                  <description>EVSTAT0.AUXIO0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_PROG_WU</name>
                  <value>12</value>
                  <description>EVSTAT0.AON_PROG_WU</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_SW</name>
                  <value>11</value>
                  <description>EVSTAT0.AON_SW</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBSMUX1</name>
                  <value>10</value>
                  <description>EVSTAT0.OBSMUX1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBSMUX0</name>
                  <value>9</value>
                  <description>EVSTAT0.OBSMUX0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_FIFO_ALMOST_FULL</name>
                  <value>8</value>
                  <description>EVSTAT0.ADC_FIFO_ALMOST_FULL</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DONE</name>
                  <value>7</value>
                  <description>EVSTAT0.ADC_DONE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMPH_AUTOTAKE_DONE</name>
                  <value>6</value>
                  <description>EVSTAT0.SMPH_AUTOTAKE_DONE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER1_EV</name>
                  <value>5</value>
                  <description>EVSTAT0.TIMER1_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER0_EV</name>
                  <value>4</value>
                  <description>EVSTAT0.TIMER0_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TDC_DONE</name>
                  <value>3</value>
                  <description>EVSTAT0.TDC_DONE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPB</name>
                  <value>2</value>
                  <description>EVSTAT0.AUX_COMPB</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPA</name>
                  <value>1</value>
                  <description>EVSTAT0.AUX_COMPA</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_RTC_CH2</name>
                  <value>0</value>
                  <description>EVSTAT0.AON_RTC_CH2</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SCEWEVSEL</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Sensor Controller Engine Wait Event Selection

