seanmlyons22/ti-lprf-pacs/svds/cc2640r2.svd
0: Exclude.
1: Include.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_DONE</name>
              <description>[7:7] EVTOMCUFLAGS.ADC_DONE contribution to the AUX_COMB event.

0: Exclude.
1: Include.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPH_AUTOTAKE_DONE</name>
              <description>[6:6] EVTOMCUFLAGS.SMPH_AUTOTAKE_DONE contribution to the AUX_COMB event.

0: Exclude.
1: Include.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_EV</name>
              <description>[5:5] EVTOMCUFLAGS.TIMER1_EV contribution to the AUX_COMB event.

0: Exclude.
1: Include.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_EV</name>
              <description>[4:4] EVTOMCUFLAGS.TIMER0_EV contribution to the AUX_COMB event.

0: Exclude.
1: Include.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>TDC_DONE</name>
              <description>[3:3] EVTOMCUFLAGS.TDC_DONE contribution to the AUX_COMB event.

0: Exclude.
1: Include.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>AUX_COMPB</name>
              <description>[2:2] EVTOMCUFLAGS.AUX_COMPB contribution to the AUX_COMB event.

0: Exclude
1: Include.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>AUX_COMPA</name>
              <description>[1:1] EVTOMCUFLAGS.AUX_COMPA contribution to the AUX_COMB event.

0: Exclude.
1: Include.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>AON_WU_EV</name>
              <description>[0:0] EVTOMCUFLAGS.AON_WU_EV contribution to the AUX_COMB event.

0: Exclude.
1: Include.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>VECFLAGS</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>Vector Flags

If a vector flag becomes 1 and AUX_SCE sleeps, AUX_SCE will wake up and execute the corresponding vector. The vector with the lowest index will execute first if multiple vectors flags are set. AUX_SCE must return to sleep to execute the next vector.

During execution of a vector, AUX_SCE must clear the vector flag that triggered execution. Write 1 to bit index n in VECFLAGSCLR to clear vector flag n.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VEC3</name>
              <description>[3:3] Vector flag 3.

The vector flag is set if the edge selected VECCFG1.VEC3_POL occurs on the event selected in VECCFG1.VEC3_EV.

The flag is cleared by writing a 0 to this bit, or (preferably) a 1 to VECFLAGSCLR.VEC3.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>VEC2</name>
              <description>[2:2] Vector flag 2.

The vector flag is set if the edge selected VECCFG1.VEC2_POL occurs on the event selected in VECCFG1.VEC2_EV.

The flag is cleared by writing a 0 to this bit, or (preferably) a 1 to VECFLAGSCLR.VEC2.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>VEC1</name>
              <description>[1:1] Vector flag 1.

The vector flag is set if the edge selected VECCFG0.VEC1_POL occurs on the event selected in VECCFG0.VEC1_EV.

The flag is cleared by writing a 0 to this bit, or (preferably) a 1 to VECFLAGSCLR.VEC1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>VEC0</name>
              <description>[0:0] Vector flag 0.

The vector flag is set if the edge selected VECCFG0.VEC0_POL occurs on the event selected in VECCFG0.VEC0_EV.

The flag is cleared by writing a 0 to this bit, or (preferably) a 1 to VECFLAGSCLR.VEC0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>EVTOMCUFLAGSCLR</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>Events To MCU Flags Clear

Clear event flags in EVTOMCUFLAGS.

In order to clear a level sensitive event flag, the event must be deasserted.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED11</name>
              <description>[31:11] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>21</bitWidth>
              <bitOffset>11</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_IRQ</name>
              <description>[10:10] Write 1 to clear EVTOMCUFLAGS.ADC_IRQ.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>OBSMUX0</name>
              <description>[9:9] Write 1 to clear EVTOMCUFLAGS.MCU_OBSMUX0.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_FIFO_ALMOST_FULL</name>
              <description>[8:8] Write 1 to clear EVTOMCUFLAGS.ADC_FIFO_ALMOST_FULL.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_DONE</name>
              <description>[7:7] Write 1 to clear EVTOMCUFLAGS.ADC_DONE.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>SMPH_AUTOTAKE_DONE</name>
              <description>[6:6] Write 1 to clear EVTOMCUFLAGS.SMPH_AUTOTAKE_DONE.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER1_EV</name>
              <description>[5:5] Write 1 to clear EVTOMCUFLAGS.TIMER1_EV.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER0_EV</name>
              <description>[4:4] Write 1 to clear EVTOMCUFLAGS.TIMER0_EV.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>TDC_DONE</name>
              <description>[3:3] Write 1 to clear EVTOMCUFLAGS.TDC_DONE.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>AUX_COMPB</name>
              <description>[2:2] Write 1 to clear EVTOMCUFLAGS.AUX_COMPB.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>AUX_COMPA</name>
              <description>[1:1] Write 1 to clear EVTOMCUFLAGS.AUX_COMPA.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>AON_WU_EV</name>
              <description>[0:0] Write 1 to clear EVTOMCUFLAGS.AON_WU_EV.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>EVTOAONFLAGSCLR</name>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <description>Events To AON Clear

Clear event flags in EVTOAONFLAGS.

In order to clear a level sensitive event flag, the event must be deasserted.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>[31:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>23</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER1_EV</name>
              <description>[8:8] Write 1 to clear EVTOAONFLAGS.TIMER1_EV.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER0_EV</name>
              <description>[7:7] Write 1 to clear EVTOAONFLAGS.TIMER0_EV.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>TDC_DONE</name>
              <description>[6:6] Write 1 to clear EVTOAONFLAGS.TDC_DONE.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_DONE</name>
              <description>[5:5] Write 1 to clear EVTOAONFLAGS.ADC_DONE.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>AUX_COMPB</name>
              <description>[4:4] Write 1 to clear EVTOAONFLAGS.AUX_COMPB.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>AUX_COMPA</name>
              <description>[3:3] Write 1 to clear EVTOAONFLAGS.AUX_COMPA.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>SWEV2</name>
              <description>[2:2] Write 1 to clear EVTOAONFLAGS.SWEV2.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>SWEV1</name>
              <description>[1:1] Write 1 to clear EVTOAONFLAGS.SWEV1.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>SWEV0</name>
              <description>[0:0] Write 1 to clear EVTOAONFLAGS.SWEV0.

Read value is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>VECFLAGSCLR</name>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <description>Vector Flags Clear

