seanmlyons22/ti-lprf-pacs/svds/cc2640r2.svd
This bit must remain set until WUEVFLAGS.AON_PROG_WU returns to 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADCCLKCTL</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>ADC Clock Control

Controls the ADC internal clock

Note that the ADC command and data interface requires MODCLKEN0.ANAIF or MODCLKEN1.ANAIF also to be set</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ACK</name>
              <description>[1:1] Acknowledges the last value written to REQ.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>REQ</name>
              <description>[0:0] Enables(1) or disables (0) the ADC internal clock.

This bit must not be modified unless ACK matches the current value.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>TDCCLKCTL</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>TDC Clock Control

Controls the TDC counter clock source, which steps the TDC counter value

The source of this clock is controlled by OSC_DIG:CTL0.ACLK_TDC_SRC_SEL.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ACK</name>
              <description>[1:1] Acknowledges the last value written to REQ.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>REQ</name>
              <description>[0:0] Enables(1) or disables (0) the TDC counter clock source.

This bit must not be modified unless ACK matches the current value.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>REFCLKCTL</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>Reference Clock Control

Controls the TDC reference clock source, which is to be compared against the TDC counter clock.

The source of this clock is controlled by OSC_DIG:CTL0.ACLK_REF_SRC_SEL.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ACK</name>
              <description>[1:1] Acknowledges the last value written to REQ.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>REQ</name>
              <description>[0:0] Enables(1) or disables (0) the TDC reference clock source.

This bit must not be modified unless ACK matches the current value.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RTCSUBSECINC0</name>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <description>Real Time Counter Sub Second Increment 0

New value for the real-time counter (AON_RTC) sub-second increment value, part corresponding to AON_RTC:SUBSECINC bits 15:0.

After setting INC15_0 and RTCSUBSECINC1.INC23_16, the value is loaded into AON_RTC:SUBSECINC.VALUEINC by setting RTCSUBSECINCCTL.UPD_REQ.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>INC15_0</name>
              <description>[15:0] Bits 15:0 of the RTC sub-second increment value.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RTCSUBSECINC1</name>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <description>Real Time Counter Sub Second Increment 1

New value for the real-time counter (AON_RTC) sub-second increment value, part corresponding to AON_RTC:SUBSECINC bits 23:16.

After setting RTCSUBSECINC0.INC15_0 and INC23_16, the value is loaded into AON_RTC:SUBSECINC.VALUEINC by setting RTCSUBSECINCCTL.UPD_REQ.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>INC23_16</name>
              <description>[7:0] Bits 23:16 of the RTC sub-second increment value.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RTCSUBSECINCCTL</name>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <description>Real Time Counter Sub Second Increment Control</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>UPD_ACK</name>
              <description>[1:1] Acknowledgment of the UPD_REQ.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>UPD_REQ</name>
              <description>[0:0] Signal that a new real time counter sub second increment value is available

0: New sub second increment is not available
1: New sub second increment is available

