seanmlyons22/ti-lprf-pacs/svds/cc2640r2.svd
        <register>
          <name>STIM22</name>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <description>Stimulus Port 22</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>STIM22</name>
              <description>[31:0] A write to this location causes data to be written into the FIFO if TER.STIMENA22 is set. Reading from the stimulus port returns the FIFO status in bit [0]: 0 = full, 1 = not full. The polled FIFO interface does not provide an atomic read-modify-write, so it's users responsibility to ensure exclusive read-modify-write if this ITM port is used concurrently by interrupts or other threads.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM23</name>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <description>Stimulus Port 23</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>STIM23</name>
              <description>[31:0] A write to this location causes data to be written into the FIFO if TER.STIMENA23 is set. Reading from the stimulus port returns the FIFO status in bit [0]: 0 = full, 1 = not full. The polled FIFO interface does not provide an atomic read-modify-write, so it's users responsibility to ensure exclusive read-modify-write if this ITM port is used concurrently by interrupts or other threads.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM24</name>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <description>Stimulus Port 24</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>STIM24</name>
              <description>[31:0] A write to this location causes data to be written into the FIFO if TER.STIMENA24 is set. Reading from the stimulus port returns the FIFO status in bit [0]: 0 = full, 1 = not full. The polled FIFO interface does not provide an atomic read-modify-write, so it's users responsibility to ensure exclusive read-modify-write if this ITM port is used concurrently by interrupts or other threads.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM25</name>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <description>Stimulus Port 25</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>STIM25</name>
              <description>[31:0] A write to this location causes data to be written into the FIFO if TER.STIMENA25 is set. Reading from the stimulus port returns the FIFO status in bit [0]: 0 = full, 1 = not full. The polled FIFO interface does not provide an atomic read-modify-write, so it's users responsibility to ensure exclusive read-modify-write if this ITM port is used concurrently by interrupts or other threads.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM26</name>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <description>Stimulus Port 26</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>STIM26</name>
              <description>[31:0] A write to this location causes data to be written into the FIFO if TER.STIMENA26 is set. Reading from the stimulus port returns the FIFO status in bit [0]: 0 = full, 1 = not full. The polled FIFO interface does not provide an atomic read-modify-write, so it's users responsibility to ensure exclusive read-modify-write if this ITM port is used concurrently by interrupts or other threads.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM27</name>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <description>Stimulus Port 27</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>STIM27</name>
              <description>[31:0] A write to this location causes data to be written into the FIFO if TER.STIMENA27 is set. Reading from the stimulus port returns the FIFO status in bit [0]: 0 = full, 1 = not full. The polled FIFO interface does not provide an atomic read-modify-write, so it's users responsibility to ensure exclusive read-modify-write if this ITM port is used concurrently by interrupts or other threads.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM28</name>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <description>Stimulus Port 28</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>STIM28</name>
              <description>[31:0] A write to this location causes data to be written into the FIFO if TER.STIMENA28 is set. Reading from the stimulus port returns the FIFO status in bit [0]: 0 = full, 1 = not full. The polled FIFO interface does not provide an atomic read-modify-write, so it's users responsibility to ensure exclusive read-modify-write if this ITM port is used concurrently by interrupts or other threads.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM29</name>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <description>Stimulus Port 29</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>STIM29</name>
              <description>[31:0] A write to this location causes data to be written into the FIFO if TER.STIMENA29 is set. Reading from the stimulus port returns the FIFO status in bit [0]: 0 = full, 1 = not full. The polled FIFO interface does not provide an atomic read-modify-write, so it's users responsibility to ensure exclusive read-modify-write if this ITM port is used concurrently by interrupts or other threads.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM30</name>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <description>Stimulus Port 30</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>STIM30</name>
              <description>[31:0] A write to this location causes data to be written into the FIFO if TER.STIMENA30 is set. Reading from the stimulus port returns the FIFO status in bit [0]: 0 = full, 1 = not full. The polled FIFO interface does not provide an atomic read-modify-write, so it's users responsibility to ensure exclusive read-modify-write if this ITM port is used concurrently by interrupts or other threads.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIM31</name>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <description>Stimulus Port 31</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>STIM31</name>
              <description>[31:0] A write to this location causes data to be written into the FIFO if TER.STIMENA31 is set. Reading from the stimulus port returns the FIFO status in bit [0]: 0 = full, 1 = not full. The polled FIFO interface does not provide an atomic read-modify-write, so it's users responsibility to ensure exclusive read-modify-write if this ITM port is used concurrently by interrupts or other threads.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>TER</name>
          <addressOffset>0xe00</addressOffset>
          <size>32</size>
          <description>Trace Enable
Use the Trace Enable Register to generate trace data by writing to the corresponding stimulus port. Note: Privileged writes are accepted to this register if TCR.ITMENA is set. User writes are accepted to this register if TCR.ITMENA is set and the appropriate privilege mask is cleared. Privileged access to the stimulus ports enables an RTOS kernel to guarantee instrumentation slots or bandwidth as required.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>STIMENA31</name>
              <description>[31:31] Bit mask to enable tracing on ITM stimulus port 31.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA30</name>
              <description>[30:30] Bit mask to enable tracing on ITM stimulus port 30.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA29</name>
              <description>[29:29] Bit mask to enable tracing on ITM stimulus port 29.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA28</name>
              <description>[28:28] Bit mask to enable tracing on ITM stimulus port 28.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>28</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA27</name>
              <description>[27:27] Bit mask to enable tracing on ITM stimulus port 27.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>27</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA26</name>
              <description>[26:26] Bit mask to enable tracing on ITM stimulus port 26.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>26</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA25</name>
              <description>[25:25] Bit mask to enable tracing on ITM stimulus port 25.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>25</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA24</name>
              <description>[24:24] Bit mask to enable tracing on ITM stimulus port 24.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA23</name>
              <description>[23:23] Bit mask to enable tracing on ITM stimulus port 23.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>23</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA22</name>
              <description>[22:22] Bit mask to enable tracing on ITM stimulus port 22.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>22</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA21</name>
              <description>[21:21] Bit mask to enable tracing on ITM stimulus port 21.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>21</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA20</name>
              <description>[20:20] Bit mask to enable tracing on ITM stimulus port 20.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>20</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA19</name>
              <description>[19:19] Bit mask to enable tracing on ITM stimulus port 19.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>19</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA18</name>
              <description>[18:18] Bit mask to enable tracing on ITM stimulus port 18.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA17</name>
              <description>[17:17] Bit mask to enable tracing on ITM stimulus port 17.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA16</name>
              <description>[16:16] Bit mask to enable tracing on ITM stimulus port 16.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA15</name>
              <description>[15:15] Bit mask to enable tracing on ITM stimulus port 15.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA14</name>
              <description>[14:14] Bit mask to enable tracing on ITM stimulus port 14.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA13</name>
              <description>[13:13] Bit mask to enable tracing on ITM stimulus port 13.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA12</name>
              <description>[12:12] Bit mask to enable tracing on ITM stimulus port 12.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA11</name>
              <description>[11:11] Bit mask to enable tracing on ITM stimulus port 11.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA10</name>
              <description>[10:10] Bit mask to enable tracing on ITM stimulus port 10.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA9</name>
              <description>[9:9] Bit mask to enable tracing on ITM stimulus port 9.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA8</name>
              <description>[8:8] Bit mask to enable tracing on ITM stimulus port 8.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA7</name>
              <description>[7:7] Bit mask to enable tracing on ITM stimulus port 7.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA6</name>
              <description>[6:6] Bit mask to enable tracing on ITM stimulus port 6.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA5</name>
              <description>[5:5] Bit mask to enable tracing on ITM stimulus port 5.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA4</name>
              <description>[4:4] Bit mask to enable tracing on ITM stimulus port 4.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA3</name>
              <description>[3:3] Bit mask to enable tracing on ITM stimulus port 3.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA2</name>
              <description>[2:2] Bit mask to enable tracing on ITM stimulus port 2.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA1</name>
              <description>[1:1] Bit mask to enable tracing on ITM stimulus port 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMENA0</name>
              <description>[0:0] Bit mask to enable tracing on ITM stimulus port 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>TPR</name>
          <addressOffset>0xe40</addressOffset>
          <size>32</size>
          <description>Trace Privilege
This register is used to enable an operating system to control which stimulus ports are accessible by user code. This register can only be used in privileged mode.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIVMASK</name>
              <description>[3:0] Bit mask to enable unprivileged (User) access to ITM stimulus ports:

Bit [0] enables stimulus ports 0, 1, ..., and 7.
Bit [1] enables stimulus ports 8, 9, ..., and 15.
Bit [2] enables stimulus ports 16, 17, ..., and 23.
Bit [3] enables stimulus ports 24, 25, ..., and 31.

0: User access allowed to stimulus ports
1: Privileged access only to stimulus ports</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
