seanmlyons22/ti-lprf-pacs/svds/cc2640r2.svd
        <register>
          <name>TCR</name>
          <addressOffset>0xe80</addressOffset>
          <size>32</size>
          <description>Trace Control
Use this register to configure and control ITM transfers. This register can only be written in privilege mode. DWT is not enabled in the ITM block. However, DWT stimulus entry into the FIFO is controlled by DWTENA. If DWT requires timestamping, the TSENA bit must be set.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED24</name>
              <description>[31:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>[23:23] Set when ITM events present and being drained.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>23</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>ATBID</name>
              <description>[22:16] Trace Bus ID for CoreSight system. Optional identifier for multi-source trace stream formatting. If multi-source trace is in use, this field must be written with a non-zero value.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED10</name>
              <description>[15:10] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>TSPRESCALE</name>
              <description>[9:8] Timestamp prescaler</description>
              <bitWidth>2</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV64</name>
                  <value>3</value>
                  <description>Divide by 64</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <value>2</value>
                  <description>Divide by 16</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <value>1</value>
                  <description>Divide by 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOPRESCALING</name>
                  <value>0</value>
                  <description>No prescaling</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED5</name>
              <description>[7:5] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SWOENA</name>
              <description>[4:4] Enables asynchronous clocking of the timestamp counter (when TSENA = 1). If TSENA = 0, writing this bit to 1 does not enable asynchronous clocking of the timestamp counter.

0x0: Mode disabled. Timestamp counter uses system clock from the core and counts continuously.
0x1: Timestamp counter uses lineout (data related) clock from TPIU interface. The timestamp counter is held in reset while the output line is idle.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DWTENA</name>
              <description>[3:3] Enables the DWT stimulus (hardware event packet emission to the TPIU from the DWT)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCENA</name>
              <description>[2:2] Enables synchronization packet transmission for a synchronous TPIU.
CPU_DWT:CTRL.SYNCTAP must be configured for the correct synchronization speed.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>TSENA</name>
              <description>[1:1] Enables differential timestamps. Differential timestamps are emitted when a packet is written to the FIFO with a non-zero timestamp counter, and when the timestamp counter overflows. Timestamps are emitted during idle times after a fixed number of two million cycles. This provides a time reference for packets and inter-packet gaps. If SWOENA (bit [4]) is set, timestamps are triggered by activity on the internal trace bus only. In this case there is no regular timestamp output when the ITM is idle.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>ITMENA</name>
              <description>[0:0] Enables ITM. This is the master enable, and must be set before ITM Stimulus and Trace Enable registers can be written.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>LAR</name>
          <addressOffset>0xfb0</addressOffset>
          <size>32</size>
          <description>Lock Access
This register is used to prevent write accesses to the Control Registers: TER, TPR and TCR.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>LOCK_ACCESS</name>
              <description>[31:0] A privileged write of 0xC5ACCE55 enables more write access to Control Registers TER, TPR and TCR. An invalid write removes write access.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>LSR</name>
          <addressOffset>0xfb4</addressOffset>
          <size>32</size>
          <description>Lock Status
Use this register to enable write accesses to the Control Register.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>BYTEACC</name>
              <description>[2:2] Reads 0 which means 8-bit lock access is not be implemented.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ACCESS</name>
              <description>[1:1] Write access to component is blocked. All writes are ignored, reads are permitted.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PRESENT</name>
              <description>[0:0] Indicates that a lock mechanism exists for this component.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x3</resetValue>
        </register>
