seanmlyons22/ti-lprf-pacs/svds/cc2640r2.svd
        <register>
          <name>DMAPORTERR</name>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <description>DMA Controller Port Error</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED13</name>
              <description>[31:13] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>19</bitWidth>
              <bitOffset>13</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_ERR</name>
              <description>[12:12] A 1 indicates that the Crypto peripheral has detected an AHB bus error</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED10</name>
              <description>[11:10] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>LAST_CH</name>
              <description>[9:9] Indicates which channel was serviced last (channel 0 or channel 1) by the AHB master port.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[8:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>9</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DMAHWVER</name>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <description>DMA Controller Version</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED28</name>
              <description>[31:28] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>HW_MAJOR_VER</name>
              <description>[27:24] Major version number</description>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>HW_MINOR_VER</name>
              <description>[23:20] Minor version number</description>
              <bitWidth>4</bitWidth>
              <bitOffset>20</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>HW_PATCH_LVL</name>
              <description>[19:16] Patch level.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VER_NUM_COMPL</name>
              <description>[15:8] Bit-by-bit complement of the VER_NUM field bits.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VER_NUM</name>
              <description>[7:0] Version number of the DMA Controller (209)</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1012ED1</resetValue>
        </register>
        <register>
          <name>KEYWRITEAREA</name>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <description>Key Write Area</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RAM_AREA7</name>
              <description>[7:7] Represents an area of 128 bits.
Select the key store RAM area(s) where the key(s) needs to be written.

Writing to multiple RAM locations is only possible when the selected RAM areas are sequential.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEL</name>
                  <value>1</value>
                  <description>This RAM area is selected to be written</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_SEL</name>
                  <value>0</value>
                  <description>This RAM area is not selected to be written</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM_AREA6</name>
              <description>[6:6] Represents an area of 128 bits.
Select the key store RAM area(s) where the key(s) needs to be written.

Writing to multiple RAM locations is only possible when the selected RAM areas are sequential.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEL</name>
                  <value>1</value>
                  <description>This RAM area is selected to be written</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_SEL</name>
                  <value>0</value>
                  <description>This RAM area is not selected to be written</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM_AREA5</name>
              <description>[5:5] Represents an area of 128 bits.
Select the key store RAM area(s) where the key(s) needs to be written.

