seanmlyons22/ti-lprf-pacs/svds/cc2640r2.svd
Note: For DMA operations, this bit is automatically controlled by the Crypto peripheral.
After reset, this bit is 0. After writing a context (note 1), this bit will become 1.

For typical use, this bit does NOT need to be written, but is used for status reading only. In this case, this status bit is automatically maintained by the Crypto peripheral.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_RDY</name>
              <description>[0:0] If read as 1, this status bit indicates that an AES output block is available to be retrieved by the Host.

Writing a 0 clears the bit to zero and indicates that output data is read by the Host. The AES engine can provide a next output data block.

Writing a 1 to this bit will be ignored.

Note: For DMA operations, this bit is automatically controlled by the Crypto peripheral.

For typical use, this bit does NOT need to be written, but is used for status reading only. In this case, this status bit is automatically maintained by the Crypto peripheral.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x80000000</resetValue>
        </register>
        <register>
          <name>AESDATALEN0</name>
          <addressOffset>0x554</addressOffset>
          <size>32</size>
          <description>Crypto Data Length LSW</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>LEN_LSW</name>
              <description>[31:0] Used to write the Length values to the Crypto peripheral.

This register contains bits [31:0] of the combined data length.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>AESDATALEN1</name>
          <addressOffset>0x558</addressOffset>
          <size>32</size>
          <description>Crypto Data Length MSW</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:29] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>29</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>LEN_MSW</name>
              <description>[28:0] Bits [60:32] of the combined data length.

Bits [60:0] of the crypto length registers AESDATALEN1 and AESDATALEN0 store the cryptographic data length in bytes for all modes. Once processing with this context is started, this length decrements to zero. Data lengths up to (2^61 - 1) bytes are allowed.
For GCM, any value up to 2^36 - 32 bytes can be used. This is because a 32-bit counter mode is used; the maximum number of 128-bit blocks is 2^32 - 2, resulting in a maximum number of bytes of 2^36 - 32.
Writing to this register triggers the engine to start using this context. This is valid for all modes except GCM and CCM.
Note: For the combined modes (GCM and CCM), this length does not include the authentication only data; the authentication length is specified in the AESAUTHLEN.LEN.
All modes must have a length &gt; 0. For the combined modes, it is allowed to have one of the lengths equal to zero.
For the basic encryption modes (ECB/CBC/CTR) it is allowed to program zero to the length field; in that case the length is assumed infinite.
All data must be byte (8-bit) aligned for stream cipher modes; bit aligned data streams are not supported by the Crypto peripheral. For block cipher modes, the data length must be programmed in multiples of the block cipher size, 16 bytes.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>AESAUTHLEN</name>
          <addressOffset>0x55c</addressOffset>
          <size>32</size>
          <description>AES Authentication Length</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>LEN</name>
              <description>[31:0] Authentication data length in bytes for combined mode, CCM only.
Supported AAD-lengths for CCM are from 0 to (216 - 28) bytes. Once processing with this context is started, this length decrements to zero.
Writing this register triggers the engine to start using this context for CCM.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>AESDATAOUT0</name>
          <addressOffset>0x560</addressOffset>
          <size>32</size>
          <description>Data Input/Output</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>[31:0] Data register 0 for output block data from the Crypto peripheral.
These bits = AES Output Data[31:0] of {127:0]

For normal operations, this register is not used, since data input and output is transferred from and to the AES engine via DMA.

For a Host read operation, these registers contain the 128-bit output block from the latest AES operation. Reading from a word-aligned offset within this address range will read one word (4 bytes) of data out the 4-word deep (16 bytes = 128-bits AES block) data output buffer. The words (4 words, one full block) should be read before the core will move the next block to the data output buffer. To empty the data output buffer, AESCTL.OUTPUT_RDY must be written.
For the modes with authentication (CBC-MAC, GCM and CCM), the invalid (message) bytes/words can be written with any data.

Note: The AAD / authentication only data is not copied to the output buffer but only used for authentication.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>AESDATAIN0</name>
          <addressOffset>0x560</addressOffset>
          <size>32</size>
          <description>AES Data Input/Output 0</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>[31:0] Data registers for input block data to the Crypto peripheral.
These bits = AES Input Data[31:0]  of [127:0]

For normal operations, this register is not used, since data input and output is transferred from and to the AES engine via DMA.

