seanmlyons22/ti-lprf-pacs/svds/cc2640r2.svd
For a Host write operation, these registers must be written with the 128-bit input block for the next AES operation. Writing at a word-aligned offset within this address range will store the word (4 bytes) of data into the corresponding position of 4-word deep (16 bytes = 128-bit AES block) data input buffer. This buffer is used for the next AES operation. If the last data block is not completely filled with valid data (see notes below), it is allowed to write only the words with valid data. Next AES operation is triggered by writing to AESCTL.INPUT_RDY.

Note: AES typically operates on 128 bits block multiple input data. The CTR, GCM and CCM modes form an exception. The last block of a CTR-mode message may contain less than 128 bits (refer to [NIST 800-38A]): 0 &lt; n &lt;= 128 bits. For GCM/CCM, the last block of both AAD and message data may contain less than 128 bits (refer to [NIST 800-38D]). The Crypto peripheral automatically pads or masks misaligned ending data blocks with zeroes for GCM, CCM and CBC-MAC. For CTR mode, the remaining data in an unaligned data block is ignored.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>AESDATAOUT3</name>
          <addressOffset>0x56c</addressOffset>
          <size>32</size>
          <description>AES Data Input/Output 3</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>[31:0] Data registers for output block data from the Crypto peripheral.
These bits = AES Output Data[127:96] of [127:0]

For normal operations, this register is not used, since data input and output is transferred from and to the AES engine via DMA.

For a Host read operation, these registers contain the 128-bit output block from the latest AES operation. Reading from a word-aligned offset within this address range will read one word (4 bytes) of data out the 4-word deep (16 bytes = 128-bits AES block) data output buffer. The words (4 words, one full block) should be read before the core will move the next block to the data output buffer. To empty the data output buffer, AESCTL.OUTPUT_RDY must be written.
For the modes with authentication (CBC-MAC, GCM and CCM), the invalid (message) bytes/words can be written with any data.

Note: The AAD / authentication only data is not copied to the output buffer but only used for authentication.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>AESDATAIN3</name>
          <addressOffset>0x56c</addressOffset>
          <size>32</size>
          <description>Data Input/Output</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>[31:0] Data registers for input block data to the Crypto peripheral.
These bits = AES Input Data[127:96] of [127:0]

For normal operations, this register is not used, since data input and output is transferred from and to the AES engine via DMA.

For a Host write operation, these registers must be written with the 128-bit input block for the next AES operation. Writing at a word-aligned offset within this address range will store the word (4 bytes) of data into the corresponding position of 4-word deep (16 bytes = 128-bit AES block) data input buffer. This buffer is used for the next AES operation. If the last data block is not completely filled with valid data (see notes below), it is allowed to write only the words with valid data. Next AES operation is triggered by writing to AESCTL.INPUT_RDY.

Note: AES typically operates on 128 bits block multiple input data. The CTR, GCM and CCM modes form an exception. The last block of a CTR-mode message may contain less than 128 bits (refer to [NIST 800-38A]): 0 &lt; n &lt;= 128 bits. For GCM/CCM, the last block of both AAD and message data may contain less than 128 bits (refer to [NIST 800-38D]). The Crypto peripheral automatically pads or masks misaligned ending data blocks with zeroes for GCM, CCM and CBC-MAC. For CTR mode, the remaining data in an unaligned data block is ignored.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>AESTAGOUT</name>
          <addressOffset>0x570</addressOffset>
          <size>32</size>
          <description>AES Tag Output</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>TAG</name>
              <description>[31:0] This register contains the authentication TAG for the combined and authentication-only modes.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ALGSEL</name>
          <addressOffset>0x700</addressOffset>
          <size>32</size>
          <description>Master Algorithm Select
This register configures the internal destination of the DMA controller.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>TAG</name>
              <description>[31:31] If this bit is cleared to 0, the DMA operation involves only data.
If this bit is set, the DMA operation includes a TAG (Authentication Result / Digest).</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[30:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>AES</name>
              <description>[1:1] If set to 1,  the AES data is loaded via DMA
Both Read and Write maximum transfer size to DMA engine is set to 16 bytes</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>KEY_STORE</name>
              <description>[0:0] If set to 1, selects the Key Store to be loaded via DMA.
The maximum transfer size to DMA engine is set to 32 bytes (however transfers of 16, 24 and 32 bytes are allowed)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DMAPROTCTL</name>
          <addressOffset>0x704</addressOffset>
          <size>32</size>
          <description>Master Protection Control</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>[0:0] Select AHB transfer protection control for DMA transfers using the key store area as destination.
0 : transfers use 'USER' type access.
1 : transfers use 'PRIVILEGED' type access.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SWRESET</name>
          <addressOffset>0x740</addressOffset>
          <size>32</size>
          <description>Software Reset</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET</name>
              <description>[0:0] If this bit is set to 1, the following modules are reset:
- Master control internal state is reset. That includes interrupt, error status register and result available interrupt generation FSM.
- Key store module state is reset. That includes clearing the Written Area flags; therefore the keys must be reloaded to the key store module.
Writing 0 has no effect.
The bit is self cleared after executing the reset.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IRQTYPE</name>
          <addressOffset>0x780</addressOffset>
          <size>32</size>
          <description>Control Interrupt Configuration</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>LEVEL</name>
              <description>[0:0] If this bit is 0, the interrupt output is a pulse.
If this bit is set to 1, the interrupt is a level interrupt that must be cleared by writing the interrupt clear register.
This bit is applicable for both interrupt output signals.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IRQEN</name>
          <addressOffset>0x784</addressOffset>
          <size>32</size>
          <description>Interrupt Enable</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_IN_DONE</name>
              <description>[1:1] This bit enables IRQSTAT.DMA_IN_DONE as source for IRQ.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESULT_AVAIL</name>
              <description>[0:0] This bit enables IRQSTAT.RESULT_AVAIL as source for IRQ.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IRQCLR</name>
          <addressOffset>0x788</addressOffset>
          <size>32</size>
          <description>Interrupt Clear</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>DMA_BUS_ERR</name>
              <description>[31:31] If 1 is written to this bit, IRQSTAT.DMA_BUS_ERR is cleared.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>KEY_ST_WR_ERR</name>
              <description>[30:30] If 1 is written to this bit, IRQSTAT.KEY_ST_WR_ERR is cleared.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>KEY_ST_RD_ERR</name>
              <description>[29:29] If 1 is written to this bit, IRQSTAT.KEY_ST_RD_ERR is cleared.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[28:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>27</bitWidth>
              <bitOffset>2</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA_IN_DONE</name>
              <description>[1:1] If 1 is written to this bit, IRQSTAT.DMA_IN_DONE is cleared.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>RESULT_AVAIL</name>
              <description>[0:0] If 1 is written to this bit, IRQSTAT.RESULT_AVAIL is cleared.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IRQSET</name>
          <addressOffset>0x78c</addressOffset>
          <size>32</size>
          <description>Interrupt Set</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA_IN_DONE</name>
              <description>[1:1] If 1 is written to this bit, IRQSTAT.DMA_IN_DONE is set.
Writing 0 has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>RESULT_AVAIL</name>
              <description>[0:0] If 1 is written to this bit, IRQSTAT.RESULT_AVAIL is set.
Writing 0 has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IRQSTAT</name>
          <addressOffset>0x790</addressOffset>
          <size>32</size>
          <description>Interrupt Status</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>DMA_BUS_ERR</name>
              <description>[31:31] This bit is set when a DMA bus error is detected during a DMA operation. The value of this register is held until it is cleared via IRQCLR.DMA_BUS_ERR
Note: This error is asserted if an error is detected on the AHB master interface during a DMA operation.
Note: This is not an interrupt source.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY_ST_WR_ERR</name>
              <description>[30:30] This bit is set when a write error is detected during the DMA write operation to the key store memory. The value of this register is held until it is cleared via IRQCLR.KEY_ST_WR_ERR
Note: This error is asserted if a DMA operation does not cover a full key area or more areas are written than expected.
Note: This is not an interrupt source.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY_ST_RD_ERR</name>
              <description>[29:29] This bit will be set when a read error is detected during the read of a key from the key store, while copying it to the AES engine. The value of this register is held until it is cleared via IRQCLR.KEY_ST_RD_ERR.
Note: This error is asserted if a key location is selected in the key store that is not available.
Note: This is not an interrupt source.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[28:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>27</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_IN_DONE</name>
              <description>[1:1] This bit returns the status of DMA data in done interrupt.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESULT_AVAIL</name>
              <description>[0:0] This bit is set high when the Crypto peripheral has a result available.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>HWVER</name>
          <addressOffset>0x7fc</addressOffset>
          <size>32</size>
          <description>CTRL Module Version</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED28</name>
              <description>[31:28] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>HW_MAJOR_VER</name>
              <description>[27:24] Major version number</description>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>HW_MINOR_VER</name>
              <description>[23:20] Minor version number</description>
              <bitWidth>4</bitWidth>
              <bitOffset>20</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>HW_PATCH_LVL</name>
              <description>[19:16] Patch level, starts at 0 at first delivery of this version.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VER_NUM_COMPL</name>
              <description>[15:8] These bits simply contain the complement of VER_NUM (0x87), used by a driver to ascertain that the Crypto peripheral register is indeed read.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VER_NUM</name>
              <description>[7:0] The version number for the Crypto peripheral, this field contains the value 120 (decimal) or 0x78.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x91118778</resetValue>
        </register>
