seanmlyons22/ti-lprf-pacs/svds/cc2640r2.svd
        <register>
          <name>FSPRD</name>
          <addressOffset>0x2004</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>DIS_PREEMPT</name>
              <description>[31:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RMBSEM</name>
              <description>[15:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[7:2] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RM1</name>
              <description>[1:1] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RM0</name>
              <description>[0:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FEDACCTL1</name>
          <addressOffset>0x2008</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED25</name>
              <description>[31:25] Internal. Only to be used through TI provided API.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>25</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SUSP_IGNR</name>
              <description>[24:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>EDACEN</name>
              <description>[23:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FEDACCTL2</name>
          <addressOffset>0x200c</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>SEC_THRESHOLD</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FCOR_ERR_CNT</name>
          <addressOffset>0x2010</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>COR_ERR_CNT</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FCOR_ERR_ADD</name>
          <addressOffset>0x2014</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>FCOR_ERR_ADD</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FCOR_ERR_POS</name>
          <addressOffset>0x2018</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>SERR_POS</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FEDACSTAT</name>
          <addressOffset>0x201c</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED26</name>
              <description>[31:26] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>26</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RVF_INT</name>
              <description>[25:25] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>25</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>FSM_DONE</name>
              <description>[24:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>ERR_PRF_FLG</name>
              <description>[23:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FUNC_ERR_ADD</name>
          <addressOffset>0x2020</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>FUNC_ERR_ADD</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FEDACSDIS</name>
          <addressOffset>0x2024</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>SECTORID0</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FPRIM_ADD_TAG</name>
          <addressOffset>0x2028</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRIM_ADD_TAG</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FREDU_ADD_TAG</name>
          <addressOffset>0x202c</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>REDU_ADD_TAG</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FBPROT</name>
          <addressOffset>0x2030</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Internal. Only to be used through TI provided API.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PROTL1DIS</name>
              <description>[0:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FBSE</name>
          <addressOffset>0x2034</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>BSE</name>
              <description>[15:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FBBUSY</name>
          <addressOffset>0x2038</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>[7:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0xFE</resetValue>
        </register>
        <register>
          <name>FBAC</name>
          <addressOffset>0x203c</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED17</name>
              <description>[31:17] Internal. Only to be used through TI provided API.</description>
              <bitWidth>15</bitWidth>
              <bitOffset>17</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>OTPPROTDIS</name>
              <description>[16:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>BAGP</name>
              <description>[15:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>VREADS</name>
              <description>[7:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0xF</resetValue>
        </register>
        <register>
          <name>FBFALLBACK</name>
          <addressOffset>0x2040</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED28</name>
              <description>[31:28] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>FSM_PWRSAV</name>
              <description>[27:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED20</name>
              <description>[23:20] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>20</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>REG_PWRSAV</name>
              <description>[19:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>BANKPWR7</name>
              <description>[15:14] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>14</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>BANKPWR6</name>
              <description>[13:12] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>BANKPWR5</name>
              <description>[11:10] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>BANKPWR4</name>
              <description>[9:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>BANKPWR3</name>
              <description>[7:6] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>BANKPWR2</name>
              <description>[5:4] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>BANKPWR1</name>
              <description>[3:2] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>BANKPWR0</name>
              <description>[1:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x505FFFF</resetValue>
        </register>
        <register>
          <name>FBPRDY</name>
          <addressOffset>0x2044</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED17</name>
              <description>[31:17] Internal. Only to be used through TI provided API.</description>
              <bitWidth>15</bitWidth>
              <bitOffset>17</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>BANKBUSY</name>
              <description>[16:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PUMPRDY</name>
              <description>[15:15] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[14:1] Internal. Only to be used through TI provided API.</description>
              <bitWidth>14</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>BANKRDY</name>
              <description>[0:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0xFF00FE</resetValue>
        </register>
        <register>
          <name>FPAC1</name>
          <addressOffset>0x2048</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED28</name>
              <description>[31:28] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PSLEEPTDIS</name>
              <description>[27:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PUMPRESET_PW</name>
              <description>[15:4] Internal. Only to be used through TI provided API.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[3:2] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PUMPPWR</name>
              <description>[1:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x2082081</resetValue>
        </register>
        <register>
          <name>FPAC2</name>
          <addressOffset>0x204c</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PAGP</name>
              <description>[15:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FMAC</name>
          <addressOffset>0x2050</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Internal. Only to be used through TI provided API.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>BANK</name>
              <description>[2:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
