seanmlyons22/ti-lprf-pacs/svds/cc2640r2.svd
        <register>
          <name>FEFUSECTL</name>
          <addressOffset>0x209c</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED27</name>
              <description>[31:27] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>27</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CHAIN_SEL</name>
              <description>[26:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED18</name>
              <description>[23:18] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>18</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>WRITE_EN</name>
              <description>[17:17] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>BP_SEL</name>
              <description>[16:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED9</name>
              <description>[15:9] Internal. Only to be used through TI provided API.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EF_CLRZ</name>
              <description>[8:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED5</name>
              <description>[7:5] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EF_TEST</name>
              <description>[4:4] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>EFUSE_EN</name>
              <description>[3:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x701010A</resetValue>
        </register>
        <register>
          <name>FEFUSESTAT</name>
          <addressOffset>0x20a0</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Internal. Only to be used through TI provided API.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SHIFT_DONE</name>
              <description>[0:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FEFUSEDATA</name>
          <addressOffset>0x20a4</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>FEFUSEDATA</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FSEQPMP</name>
          <addressOffset>0x20a8</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED28</name>
              <description>[31:28] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_3P4</name>
              <description>[27:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED22</name>
              <description>[23:22] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>22</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>TRIM_1P7</name>
              <description>[21:20] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>20</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_0P8</name>
              <description>[19:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED15</name>
              <description>[15:15] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VIN_AT_X</name>
              <description>[14:12] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>12</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED9</name>
              <description>[11:9] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VIN_BY_PASS</name>
              <description>[8:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_PUMP</name>
              <description>[7:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x85080000</resetValue>
        </register>
        <register>
          <name>FCLKTRIM</name>
          <addressOffset>0x20ac</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRIM_EN</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ROM_TEST</name>
          <addressOffset>0x20b0</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>ROM_KEY</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FEDACSDIS2</name>
          <addressOffset>0x20c0</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>SECTORID2</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FBSTROBES</name>
          <addressOffset>0x2100</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED25</name>
              <description>[31:25] Internal. Only to be used through TI provided API.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>25</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ECBIT</name>
              <description>[24:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED19</name>
              <description>[23:19] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>19</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RWAIT2_FLCLK</name>
              <description>[18:18] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RWAIT_FLCLK</name>
              <description>[17:17] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>FLCLKEN</name>
              <description>[16:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED9</name>
              <description>[15:9] Internal. Only to be used through TI provided API.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CTRLENZ</name>
              <description>[8:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED7</name>
              <description>[7:7] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>NOCOLRED</name>
              <description>[6:6] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>PRECOL</name>
              <description>[5:5] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>TI_OTP</name>
              <description>[4:4] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>OTP</name>
              <description>[3:3] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>TEZ</name>
              <description>[2:2] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[1:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x104</resetValue>
        </register>
        <register>
          <name>FPSTROBES</name>
          <addressOffset>0x2104</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>[31:9] Internal. Only to be used through TI provided API.</description>
              <bitWidth>23</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>EXECUTEZ</name>
              <description>[8:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[7:2] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>V3PWRDNZ</name>
              <description>[1:1] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>V5PWRDNZ</name>
              <description>[0:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x103</resetValue>
        </register>
        <register>
          <name>FBMODE</name>
          <addressOffset>0x2108</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Internal. Only to be used through TI provided API.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>MODE</name>
              <description>[2:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FTCR</name>
          <addressOffset>0x210c</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED7</name>
              <description>[31:7] Internal. Only to be used through TI provided API.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>TCR</name>
              <description>[6:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FADDR</name>
          <addressOffset>0x2110</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>FADDR</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FPMTCTL</name>
          <addressOffset>0x2114</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR_INCR</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PBISTCTL</name>
          <addressOffset>0x2118</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>PBIST_KEY</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FTCTL</name>
          <addressOffset>0x211c</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED17</name>
              <description>[31:17] Internal. Only to be used through TI provided API.</description>
              <bitWidth>15</bitWidth>
              <bitOffset>17</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>WDATA_BLK_CLR</name>
              <description>[16:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[15:2] Internal. Only to be used through TI provided API.</description>
              <bitWidth>14</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>TEST_EN</name>
              <description>[1:1] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[0:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FWPWRITE0</name>
          <addressOffset>0x2120</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>FWPWRITE0</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>FWPWRITE1</name>
          <addressOffset>0x2124</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>FWPWRITE1</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
