seanmlyons22/ti-lprf-pacs/svds/cc2640r2.svd
0: An interrupt has not occurred or is masked.
1: A master interrupt is pending.

This bit is cleared by writing 1 to the MICR.IC bit .</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MICR</name>
          <addressOffset>0x81c</addressOffset>
          <size>32</size>
          <description>Master Interrupt Clear
This register clears the raw and masked interrupt.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>IC</name>
              <description>[0:0] Interrupt clear
Writing 1 to this bit clears MRIS.RIS and  MMIS.MIS .

Reading this register returns no meaningful data.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MCR</name>
          <addressOffset>0x820</addressOffset>
          <size>32</size>
          <description>Master Configuration
This register configures the mode (Master or Slave) and sets the interface for test mode loopback.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED6</name>
              <description>[31:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>26</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SFE</name>
              <description>[5:5] I2C slave function enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Slave mode is enabled.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Slave mode is disabled.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MFE</name>
              <description>[4:4] I2C master function enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Master mode is enabled.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Master mode is disabled.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[3:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>LPBK</name>
              <description>[0:0] I2C loopback

0: Normal operation
1: Loopback operation (test mode)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Enable Test Mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Disable Test Mode</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>I2S0</name>
      <baseAddress>0x40021000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>I2S Audio DMA module supporting formats I2S, LJF, RJF and DSP</description>
      <registers>
        <register>
          <name>AIFWCLKSRC</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>WCLK Source Selection</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>WCLK_INV</name>
              <description>[2:2] Inverts WCLK source (pad or internal) when set.

