seanmlyons22/ti-lprf-pacs/svds/cc2640r2.svd
For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>CRYPTO_CLK_EN</name>
              <description>[0:0] 0: Disable clock
1: Enable clock

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SECDMACLKGDS</name>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <description>TRNG, CRYPTO And UDMA Clock Gate For Deep Sleep Mode</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>[31:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>23</bitWidth>
              <bitOffset>9</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_CLK_EN</name>
              <description>[8:8] 0: Disable clock
1: Enable clock

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[7:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>TRNG_CLK_EN</name>
              <description>[1:1] 0: Disable clock
1: Enable clock

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>CRYPTO_CLK_EN</name>
              <description>[0:0] 0: Disable clock
1: Enable clock

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>GPIOCLKGR</name>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <description>GPIO Clock Gate For Run Mode</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>[0:0] 0: Disable clock
1: Enable clock

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>GPIOCLKGS</name>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <description>GPIO Clock Gate For Sleep Mode</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>[0:0] 0: Disable clock
1: Enable clock

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>GPIOCLKGDS</name>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <description>GPIO Clock Gate For Deep Sleep Mode</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>[0:0] 0: Disable clock
1: Enable clock

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>GPTCLKGR</name>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <description>GPT Clock Gate For Run Mode</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>[3:0] Each bit below has the following meaning:

