seanmlyons22/ti-lprf-pacs/svds/cc2640r2.svd
A value of 0 is interpreted as 1024.
A value of 1 is invalid.
If MDIV is odd the low phase of the clock is one MCUCLK period longer than the high phase.

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>10</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>I2SBCLKDIV</name>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <description>BCLK Division Ratio</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED10</name>
              <description>[31:10] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>22</bitWidth>
              <bitOffset>10</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>BDIV</name>
              <description>[9:0] An unsigned factor of the division ratio used to generate I2S BCLK [2-1024]:

BCLK = MCUCLK/BDIV[Hz]
MCUCLK is 48MHz in normal mode. For powerdown mode the frequency is defined by AON_WUC:MCUCLK.PWR_DWN_SRC

A value of 0 is interpreted as 1024.
A value of 1 is invalid.
If BDIV is odd and I2SCLKCTL.SMPL_ON_POSEDGE = 0, the low phase of the clock is one MCUCLK period longer than the high phase.
If BDIV is odd and I2SCLKCTL.SMPL_ON_POSEDGE = 1 , the high phase of the clock is one MCUCLK period longer than the low phase.

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>10</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>I2SWCLKDIV</name>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <description>WCLK Division Ratio</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>WDIV</name>
              <description>[15:0] If I2SCLKCTL.WCLK_PHASE = 0, Single phase.
WCLK is high one BCLK period and low WDIV[9:0] (unsigned, [1-1023]) BCLK periods.

WCLK = MCUCLK / BDIV*(WDIV[9:0] + 1) [Hz]
MCUCLK is 48MHz in normal mode. For powerdown mode the frequency is defined by AON_WUC:MCUCLK.PWR_DWN_SRC

If I2SCLKCTL.WCLK_PHASE = 1, Dual phase.
Each phase on WCLK (50% duty cycle) is WDIV[9:0] (unsigned, [1-1023]) BCLK periods.

WCLK = MCUCLK / BDIV*(2*WDIV[9:0]) [Hz]

If I2SCLKCTL.WCLK_PHASE = 2, User defined.
WCLK is high WDIV[7:0] (unsigned, [1-255]) BCLK periods and low WDIV[15:8] (unsigned, [1-255]) BCLK periods.

WCLK = MCUCLK / (BDIV*(WDIV[7:0] + WDIV[15:8]) [Hz]

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SWRESET</name>
          <addressOffset>0x10c</addressOffset>
          <size>32</size>
          <description>SW Initiated Resets</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>MCU</name>
              <description>[2:2] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[1:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>WARMRESET</name>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <description>WARM Reset Control And Status</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>WR_TO_PINRESET</name>
              <description>[2:2] 0: No action
1: A warm system reset event triggered by the below listed sources will result in an emulated pin reset.

Warm reset sources included:
ICEPick sysreset
System CPU reset request, CPU_SCS:AIRCR.SYSRESETREQ
System CPU Lockup
WDT timeout

An active ICEPick block system reset will gate all sources except ICEPick sysreset

SW can read AON_SYSCTL:RESETCTL.RESET_SRC to find the source of the last reset resulting in a full power up sequence. WARMRESET in this register is set in the scenario that WR_TO_PINRESET=1 and one of the above listed sources is triggered.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCKUP_STAT</name>
              <description>[1:1] 0: No registred event
1: A system CPU LOCKUP event has occured since last SW clear of the register.

A read of this register clears both  WDT_STAT and LOCKUP_STAT.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>WDT_STAT</name>
              <description>[0:0] 0: No registered event
1: A WDT event has occured since last SW clear of the register.

A read of this register clears both WDT_STAT and LOCKUP_STAT.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDCTL0</name>
          <addressOffset>0x12c</addressOffset>
          <size>32</size>
          <description>Power Domain Control</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PERIPH_ON</name>
              <description>[2:2] PERIPH Power domain.

0: PERIPH power domain is powered down
1: PERIPH power domain is powered up</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SERIAL_ON</name>
              <description>[1:1] SERIAL Power domain.

0: SERIAL power domain is powered down
1: SERIAL power domain is powered up</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RFC_ON</name>
              <description>[0:0] 0: RFC power domain powered off if also PDCTL1.RFC_ON = 0
1: RFC power domain powered on</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDCTL0RFC</name>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <description>RFC Power Domain Control</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] Alias for PDCTL0.RFC_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDCTL0SERIAL</name>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <description>SERIAL Power Domain Control</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] Alias for PDCTL0.SERIAL_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDCTL0PERIPH</name>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <description>PERIPH Power Domain Control</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] Alias for PDCTL0.PERIPH_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDSTAT0</name>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <description>Power Domain Status</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>PERIPH_ON</name>
              <description>[2:2] PERIPH Power domain.

0: Domain may be powered down
1: Domain powered up (guaranteed)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SERIAL_ON</name>
              <description>[1:1] SERIAL Power domain.

0: Domain may be powered down
1: Domain powered up (guaranteed)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RFC_ON</name>
              <description>[0:0] RFC Power domain

0: Domain may be powered down
1: Domain powered up (guaranteed)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDSTAT0RFC</name>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <description>RFC Power Domain Status</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] Alias for PDSTAT0.RFC_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDSTAT0SERIAL</name>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <description>SERIAL Power Domain Status</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] Alias for PDSTAT0.SERIAL_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDSTAT0PERIPH</name>
          <addressOffset>0x14c</addressOffset>
          <size>32</size>
          <description>PERIPH Power Domain Status</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] Alias for PDSTAT0.PERIPH_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDCTL1</name>
          <addressOffset>0x17c</addressOffset>
          <size>32</size>
          <description>Power Domain Control</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED5</name>
              <description>[31:5] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED4</name>
              <description>[4:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>VIMS_MODE</name>
              <description>[3:3] 0: VIMS power domain is only powered when CPU power domain is powered.
1: VIMS power domain is powered whenever the BUS power domain is powered.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RFC_ON</name>
              <description>[2:2] 0: RFC power domain powered off if also PDCTL0.RFC_ON = 0
1: RFC power domain powered on

Bit shall be used by RFC in autonomus mode but there is no HW restrictions fom system CPU to access the bit.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_ON</name>
              <description>[1:1] 0: Causes a power down of the CPU power domain when system CPU indicates it is idle.
1: Initiates power-on of the CPU power domain.

This bit is automatically set by a WIC power-on event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[0:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0xA</resetValue>
        </register>
        <register>
          <name>PDCTL1CPU</name>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <description>CPU Power Domain Direct Control</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] This is an alias for PDCTL1.CPU_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>PDCTL1RFC</name>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <description>RFC Power Domain Direct Control</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] This is an alias for PDCTL1.RFC_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDCTL1VIMS</name>
          <addressOffset>0x18c</addressOffset>
          <size>32</size>
          <description>VIMS Mode Direct Control</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] This is an alias for PDCTL1.VIMS_MODE</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
