seanmlyons22/ti-lprf-pacs/svds/cc2640r2.svd
        <register>
          <name>PDSTAT1</name>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <description>Power Manager Status</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED5</name>
              <description>[31:5] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>BUS_ON</name>
              <description>[4:4] 0: BUS domain not accessible
1: BUS domain is currently accessible</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VIMS_MODE</name>
              <description>[3:3] 0: VIMS domain not accessible
1: VIMS domain is currently accessible</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RFC_ON</name>
              <description>[2:2] 0: RFC domain not accessible
1: RFC domain is currently accessible</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CPU_ON</name>
              <description>[1:1] 0: CPU and BUS domain not accessible
1: CPU and BUS domains are both currently accessible</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[0:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1A</resetValue>
        </register>
        <register>
          <name>PDSTAT1BUS</name>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <description>BUS Power Domain Direct Read Status</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] This is an alias for PDSTAT1.BUS_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>PDSTAT1RFC</name>
          <addressOffset>0x19c</addressOffset>
          <size>32</size>
          <description>RFC Power Domain Direct Read Status</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] This is an alias for PDSTAT1.RFC_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDSTAT1CPU</name>
          <addressOffset>0x1a0</addressOffset>
          <size>32</size>
          <description>CPU Power Domain Direct Read Status</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] This is an alias for PDSTAT1.CPU_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>PDSTAT1VIMS</name>
          <addressOffset>0x1a4</addressOffset>
          <size>32</size>
          <description>VIMS Mode Direct Read Status</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] This is an alias for PDSTAT1.VIMS_MODE</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>RFCBITS</name>
          <addressOffset>0x1cc</addressOffset>
          <size>32</size>
          <description>Control To RFC</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>READ</name>
              <description>[31:0] Control bits for RFC. The RF core CPE processor will automatically check this register when it boots, and it can be used to immediately instruct CPE to perform some tasks at its start-up. The supported functionality is ROM-defined and may vary. See the technical reference manual for more details.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RFCMODESEL</name>
          <addressOffset>0x1d0</addressOffset>
          <size>32</size>
          <description>Selected RFC Mode</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>CURR</name>
              <description>[2:0] Selects the set of commands that the RFC will accept. Only modes permitted by RFCMODEHWOPT.AVAIL are writeable. See the technical reference manual for details.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MODE7</name>
                  <value>7</value>
                  <description>Select Mode 7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE6</name>
                  <value>6</value>
                  <description>Select Mode 6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE5</name>
                  <value>5</value>
                  <description>Select Mode 5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE4</name>
                  <value>4</value>
                  <description>Select Mode 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE3</name>
                  <value>3</value>
                  <description>Select Mode 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE2</name>
                  <value>2</value>
                  <description>Select Mode 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE1</name>
                  <value>1</value>
                  <description>Select Mode 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE0</name>
                  <value>0</value>
                  <description>Select Mode 0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RFCMODEHWOPT</name>
          <addressOffset>0x1d4</addressOffset>
          <size>32</size>
          <description>Allowed RFC Modes</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>AVAIL</name>
              <description>[7:0] Permitted RFC modes. More than one mode can be permitted.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MODE7</name>
                  <value>128</value>
                  <description>Mode 7 permitted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE6</name>
                  <value>64</value>
                  <description>Mode 6 permitted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE5</name>
                  <value>32</value>
                  <description>Mode 5 permitted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE4</name>
                  <value>16</value>
                  <description>Mode 4 permitted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE3</name>
                  <value>8</value>
                  <description>Mode 3 permitted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE2</name>
                  <value>4</value>
                  <description>Mode 2 permitted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE1</name>
                  <value>2</value>
                  <description>Mode 1 permitted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE0</name>
                  <value>1</value>
                  <description>Mode 0 permitted</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PWRPROFSTAT</name>
          <addressOffset>0x1e0</addressOffset>
          <size>32</size>
          <description>Power Profiler Register</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>VALUE</name>
              <description>[7:0] SW can use these bits to timestamp the application. These bits are also available through the testtap and can thus be used by the emulator to profile in real time.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>RAMRETEN</name>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <description>Memory Retention Control</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RFC</name>
              <description>[2:2] 0: Retention for RFC SRAM disabled
1: Retention for RFC SRAM enabled

Memories controlled: CPERAM  MCERAM  RFERAM</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>VIMS</name>
              <description>[1:0] 0: Memory retention disabled
1: Memory retention enabled

Bit 0: VIMS_TRAM
Bit 1: VIMS_CRAM

Legal modes depend on settings in VIMS:CTL.MODE

00: VIMS:CTL.MODE must be OFF before DEEPSLEEP is asserted - must be set to CACHE or SPLIT mode after waking up again
01: VIMS:CTL.MODE must be GPRAM before DEEPSLEEP is asserted. Must remain in GPRAM mode after wake up, alternatively select OFF mode first and then CACHE or SPILT mode.
10: Illegal mode
11: No restrictions</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x3</resetValue>
        </register>
