seanmlyons22/ti-lprf-pacs/svds/cc2640r2.svd
        <register>
          <name>MIS</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>Masked Interrupt Status</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>TXMIS</name>
              <description>[3:3] Masked interrupt state of transmit FIFO interrupt:
This field returns the masked interrupt state of transmit FIFO interrupt which is the AND product of raw interrupt state RIS.TXRIS and the mask setting IMSC.TXIM.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RXMIS</name>
              <description>[2:2] Masked interrupt state of receive FIFO interrupt:
This field returns the masked interrupt state of receive FIFO interrupt which is the AND product of raw interrupt state RIS.RXRIS and the mask setting IMSC.RXIM.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RTMIS</name>
              <description>[1:1] Masked interrupt state of receive timeout interrupt:
This field returns the masked interrupt state of receive timeout interrupt which is the AND product of raw interrupt state RIS.RTRIS and the mask setting IMSC.RTIM.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>RORMIS</name>
              <description>[0:0] Masked interrupt state of receive overrun interrupt:
This field returns the masked interrupt state of receive overrun interrupt which is the AND product of raw interrupt state RIS.RORRIS and the mask setting IMSC.RORIM.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ICR</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>Interrupt Clear
On a write of 1, the corresponding interrupt is cleared. A write of 0 has no effect.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>RTIC</name>
              <description>[1:1] Clear the receive timeout interrupt:
Writing 1 to this field clears the timeout interrupt (RIS.RTRIS). Writing 0 has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>RORIC</name>
              <description>[0:0] Clear the receive overrun interrupt:
Writing 1 to this field clears the overrun error interrupt (RIS.RORRIS). Writing 0 has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DMACR</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>DMA Control</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>TXDMAE</name>
              <description>[1:1] Transmit DMA enable. If this bit is set to 1, DMA for the transmit FIFO is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RXDMAE</name>
              <description>[0:0] Receive DMA enable. If this bit is set to 1, DMA for the receive FIFO is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RESERVED1</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RESERVED2</name>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
