seanmlyons22/ti-lprf-pacs/svds/cc2640r2.svd
Read as:
Bit [Ch] = 0: uDMA channel Ch is using the default priority level.
Bit [Ch] = 1: uDMA channel Ch is using a high priority level.

Write as:
Bit [Ch] = 0: No effect. Use the CLEARCHNLPRIORITY.CHNLS to set channel Ch to the default priority level.
Bit [Ch] = 1: Channel Ch uses the high priority level.

Writing to a bit where a uDMA channel is not implemented has no effect</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CLEARCHNLPRIORITY</name>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <description>Clear Channel Priority</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHNLS</name>
              <description>[31:0] Clear the appropriate bit to select the default priority level for the specified uDMA channel.

Write as:
Bit [Ch] = 0: No effect. Use the SETCHNLPRIORITY.CHNLS to set channel Ch to the high priority level.
Bit [Ch] = 1: Channel Ch uses the default priority level.

Writing to a bit where a uDMA channel is not implemented has no effect</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>write-only</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ERROR</name>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <description>Error Status and Clear</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
              <access>write-only</access>
            </field>
            <field>
              <name>STATUS</name>
              <description>[0:0] Returns the status of bus error flag in uDMA, or clears this bit

Read as:

0: No bus error detected
1: Bus error detected

Write as:

0: No effect, status of bus error flag is unchanged.
1: Clears the bus error flag.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>REQDONE</name>
          <addressOffset>0x504</addressOffset>
          <size>32</size>
          <description>Channel Request Done</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHNLS</name>
              <description>[31:0] Reflects the uDMA done status for the given channel, channel [Ch]. It's a sticky done bit. Unless cleared by writing a 1, it holds the value of 1.

Read as:
Bit [Ch] = 0: Request has not completed for channel Ch
Bit [Ch] = 1: Request has completed for the channel Ch

Writing a 1 to individual bits would clear the corresponding bit.

Write as:
Bit [Ch] = 0: No effect.
Bit [Ch] = 1: The corresponding [Ch] bit is cleared  and is set to 0</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DONEMASK</name>
          <addressOffset>0x520</addressOffset>
          <size>32</size>
          <description>Channel Request Done Mask</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHNLS</name>
              <description>[31:0] Controls the propagation of the uDMA done and active state to the assigned peripheral. Specifically used for software channels.

Read as:
Bit [Ch] = 0: uDMA done and active state for channel Ch is not blocked from reaching to the peripherals.
Note that the uDMA done state for channel [Ch] is blocked from contributing to generation of combined uDMA done signal

Bit [Ch] = 1: uDMA done and active state for channel Ch is blocked from reaching to the peripherals.
Note that the uDMA done state for channel [Ch] is not blocked from contributing to generation of combined uDMA done signal

Write as:
Bit [Ch] = 0: Allows uDMA done and active stat to propagate to the peripherals.
Note that this disables uDMA done state for channel [Ch] from contributing to generation of combined uDMA done signal

Bit [Ch] = 1: Blocks uDMA done and active state to propagate to the peripherals.
Note that this enables uDMA done for  channel [Ch] to contribute to generation of combined uDMA done signal.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-write</access>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>VIMS</name>
      <baseAddress>0x40034000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Versatile Instruction Memory System
Controls memory access to the Flash and encapsulates the following instruction memories:
- Boot ROM
- Cache / GPRAM</description>
      <registers>
        <register>
          <name>STAT</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Status
Displays current VIMS mode and line buffer status</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESERVED6</name>
              <description>[31:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>26</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>IDCODE_LB_DIS</name>
              <description>[5:5] Icode/Dcode flash line buffer status

0: Enabled or in transition to disabled
1: Disabled and flushed</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSBUS_LB_DIS</name>
              <description>[4:4] Sysbus flash line buffer control

0: Enabled or in transition to disabled
1: Disabled and flushed</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>MODE_CHANGING</name>
              <description>[3:3] VIMS mode change status

0: VIMS is in the mode defined by MODE
1: VIMS is in the process of changing to the mode given in CTL.MODE</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>INV</name>
              <description>[2:2] This bit is set when invalidation of the cache memory is active / ongoing</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>MODE</name>
              <description>[1:0] Current VIMS mode</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <value>3</value>
                  <description>VIMS Off mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CACHE</name>
                  <value>1</value>
                  <description>VIMS Cache mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPRAM</name>
                  <value>0</value>
                  <description>VIMS GPRAM mode</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CTL</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Control
Configure VIMS mode and line buffer settings</description>
          <access>read-write</access>
          <fields>
            <field>
              <name>STATS_CLR</name>
              <description>[31:31] Set this bit to clear statistic counters.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>STATS_EN</name>
              <description>[30:30] Set this bit to enable statistic counters.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>DYN_CG_EN</name>
              <description>[29:29] 0: The in-built clock gate functionality is bypassed.
1: The in-built clock gate functionality is enabled, automatically gating the clock when not needed.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED6</name>
              <description>[28:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>23</bitWidth>
              <bitOffset>6</bitOffset>
              <access>read-only</access>
            </field>
            <field>
              <name>IDCODE_LB_DIS</name>
              <description>[5:5] Icode/Dcode flash line buffer control

0: Enable
1: Disable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSBUS_LB_DIS</name>
              <description>[4:4] Sysbus flash line buffer control

0: Enable
1: Disable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <access>read-write</access>
            </field>
            <field>
              <name>ARB_CFG</name>
              <description>[3:3] Icode/Dcode and sysbus arbitation scheme

